vlm/base/Reports/бит_РасчетныеСведенияУФСИН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_РасчетныеСведенияУФСИН</Name>
			<Comment>ЛТ7.3</Comment>
		</Properties>
	</Report>
</MetaDataObject>

vlm/base/CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатВТомЧислеЗаСчетФБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РанееНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатФСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыНорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксСтрока</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксРасчетВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетнаяБазаЗаЕдиницуНормыВремени</Name>
					<Comment>Расчетная база на единицу нормы времени для расчета сторно-записей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииНормыВремени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СторнируемыйДокумент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийГрафик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перерасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПоРазовымНачислениямДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторРазовогоНачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистраторРазовогоНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СторнируемыйДокумент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СторноТекущегоПериода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументИсправляемыйВТекущемПериоде</v8:TypeSet>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

vlm/base/CalculationRegisters/Удержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>Удержания</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Удержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУдержания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеВзыскания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

vlm/base/Reports/бит_РасчетныеСведенияУФСИН/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	//УстановитьПривилегированныйРежим(Истина);
		
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	Организация = Настройки.ПараметрыДанных.Элементы.Найти("Организация").Значение;
	
	ДатаНачала = Настройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаНачала;
	Если НЕ ЗначениеЗаполнено(ДатаНачала)Тогда
		ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ДатаОкончания = Настройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаОкончания;
	Если НЕ ЗначениеЗаполнено(ДатаОкончания)Тогда
		ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ДанныеДляПечати = Настройки.ПараметрыДанных.Элементы.Найти("ДанныеДляПечати");
	Если НЕ ДанныеДляПечати = Неопределено Тогда
		ДанныеДляПечати = ДанныеДляПечати.Значение;
	КонецЕсли; 
	
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ДатаОкончания);	
	АдресОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес");
    Телефоны = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "Телефоны");
	
	Если ДанныеДляПечати Тогда
				
		ОбластьЗаголовок = ПолучитьМакет("МакетЗаголовка").ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Организация = Организация.НаименованиеПолное;
		ОбластьЗаголовок.Параметры.ИННКПП = "ИНН/КПП " + Организация.ИНН + "/" + Организация.КПП;
		ОбластьЗаголовок.Параметры.АдресОрганизации = АдресОрганизации;
		
		ДокументРезультат.Вывести(ОбластьЗаголовок);
		
	КонецЕсли;
	
	ОбластьОбщийЗаголовок = ПолучитьМакет("МакетЗаголовка").ПолучитьОбласть("ОбщийЗаголовок");
	
	ДокументРезультат.Вывести(ОбластьОбщийЗаголовок);
	
	НеУчитываемыеНачисления = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.НеУчитываемыеНачисления, ЭтотОбъект, Ложь);
	//ПроцентУдержанияПоказатель = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПроцентУдержанияПоказатель, ЭтотОбъект, Ложь);
	УдержаниеВДоходГосутдарстваУдержание = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.УдержаниеВДоходГосутдарстваУдержание, ЭтотОбъект, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.ФизическоеЛицо.Наименование КАК ФИО,
		|	НАЧАЛОПЕРИОДА(Начисления.БазовыйПериодНачало, ДЕНЬ) КАК БазовыйПериодНачало,
		|	СУММА(Начисления.Результат) КАК СуммаНачислений,
		|	СУММА(0) КАК СуммаУдержаний
		|ПОМЕСТИТЬ вт_Итоговая
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.ПериодРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Начисления.Организация = &Организация
		|	И Начисления.Сотрудник.бит_ЯвляетсяОсужденным
		|	И НЕ Начисления.ВидРасчета В (&НеУчитываемыеНачисления)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Начисления.БазовыйПериодНачало, ДЕНЬ),
		|	Начисления.ФизическоеЛицо.Наименование
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Удержания.ФизическоеЛицо.Наименование,
		|	НАЧАЛОПЕРИОДА(Удержания.БазовыйПериодНачало, ДЕНЬ),
		|	СУММА(0),
		|	СУММА(Удержания.Результат)
		|ИЗ
		|	РегистрРасчета.Удержания КАК Удержания
		|ГДЕ
		|	Удержания.ПериодРегистрации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Удержания.Организация = &Организация
		|	И Удержания.ВидРасчета В(&УдержаниеВДоходГосутдарстваУдержание)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Удержания.БазовыйПериодНачало, ДЕНЬ),
		|	Удержания.ФизическоеЛицо.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Итоговая.ФИО КАК ФИО,
		|	вт_Итоговая.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	СУММА(вт_Итоговая.СуммаНачислений) КАК СуммаНачислений,
		|	СУММА(вт_Итоговая.СуммаУдержаний) КАК СуммаУдержаний
		|ИЗ
		|	вт_Итоговая КАК вт_Итоговая
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_Итоговая.ФИО,
		|	вт_Итоговая.БазовыйПериодНачало
		|
		|УПОРЯДОЧИТЬ ПО
		|	вт_Итоговая.БазовыйПериодНачало,
		|	вт_Итоговая.ФИО";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("НеУчитываемыеНачисления", НеУчитываемыеНачисления);	
	Запрос.УстановитьПараметр("УдержаниеВДоходГосутдарстваУдержание", УдержаниеВДоходГосутдарстваУдержание);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ТЗ.Колонки.Добавить("НПП", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4)));
	ТЗ.Колонки.Добавить("Месяц", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20)));
	ТЗ.Колонки.Добавить("СтрокаПоиска", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	
	н = 1;
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		СтрокаТЗ.НПП = н;
		СтрокаТЗ.Месяц = Формат(СтрокаТЗ.БазовыйПериодНачало, "ДФ='ММММ гггг ""г.""'");
		СтрокаТЗ.СтрокаПоиска = СтрокаТЗ.ФИО + " " + Строка(СтрокаТЗ.СуммаУдержаний);
		н = н + 1;
		
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.НПП КАК НПП,
		|	ТЗ.ФИО КАК ФИО,
		|	ТЗ.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	ТЗ.Месяц КАК Месяц,
		|	ТЗ.СуммаНачислений КАК СуммаНачислений,
		|	ТЗ.СуммаУдержаний КАК СуммаУдержаний,
		|	ТЗ.СтрокаПоиска КАК СтрокаПоиска
		|ПОМЕСТИТЬ вт_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ТЗ.НПП КАК НПП,
		|	вт_ТЗ.ФИО КАК ФИО,
		|	вт_ТЗ.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	вт_ТЗ.Месяц КАК Месяц,
		|	вт_ТЗ.СуммаНачислений КАК СуммаНачислений,
		|	вт_ТЗ.СуммаУдержаний КАК СуммаУдержаний,
		|	вт_ТЗ.СтрокаПоиска КАК СтрокаПоиска,
		|	СписаниеБезналичныхДенежныхСредств.Номер КАК НомерСБДС,
		|	СписаниеБезналичныхДенежныхСредств.Дата КАК ДатаСБДС,
		|	СТРНАЙТИ(СписаниеБезналичныхДенежныхСредств.НазначениеПлатежа, вт_ТЗ.СтрокаПоиска) КАК Поле1
		|ИЗ
		|	вт_ТЗ КАК вт_ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
		|		ПО (СписаниеБезналичныхДенежныхСредств.Проведен)
		|			И (НЕ СписаниеБезналичныхДенежныхСредств.ПометкаУдаления)
		|			И (СТРНАЙТИ(СписаниеБезналичныхДенежныхСредств.НазначениеПлатежа, вт_ТЗ.СтрокаПоиска) <> 0)
		|			И (НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(вт_ТЗ.БазовыйПериодНачало, МЕСЯЦ, 1), МЕСЯЦ) = НАЧАЛОПЕРИОДА(СписаниеБезналичныхДенежныхСредств.Дата, МЕСЯЦ))
		|			И (СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств))";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ТЗ.Колонки.Добавить("ДатаНомерПП", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.НомерСБДС) Тогда			
			СтрокаТЗ.ДатаНомерПП = СтрокаТЗ.НомерСБДС + " от " + Формат(СтрокаТЗ.ДатаСБДС, "ДФ=dd.MM.yyyy");			
		КонецЕсли;

	КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗ", ТЗ);
	
	Схема = СхемаКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ДанныеДляПечати Тогда
		
		ОбластьПодвал = ПолучитьМакет("МакетПодвала").ПолучитьОбласть("Подвал");
		
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, ДатаОкончания);	
		ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
		
		ОбластьПодвал.Параметры.ФИОГлавногоБухгалтера = ГлавныйБухгалтер;
		ОбластьПодвал.Параметры.НомерТелефона = Телефоны;
		ОбластьПодвал.Параметры.ФИОИсполнителя = ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо;
		
		ДокументРезультат.Вывести(ОбластьПодвал);
		
	КонецЕсли;
		
КонецПроцедуры
